# Target encoding

In [3]:
#import paskages 
import pandas as pd

In [5]:
#data
# Sample data
data = {'Boro': ['Manhattan', 'Queens', 'Manhattan', 'Brooklyn', 'Brooklyn', 'Bronx'],
        'Salary': [103, 89, 142, 54, 63, 219],
        'Vegan': [0, 0, 0, 1, 1, 0]}
df = pd.DataFrame(data)
df.head()

        Boro  Salary  Vegan
0  Manhattan     103      0
1     Queens      89      0
2  Manhattan     142      0
3   Brooklyn      54      1
4   Brooklyn      63      1

In [8]:
# Calculate the mean target value (Vegan) for each category (Boro)
target_mean= df.groupby('Boro')['Vegan'].mean()
target_mean

Boro
Bronx        0.0
Brooklyn     1.0
Manhattan    0.0
Queens       0.0
Name: Vegan, dtype: float64

In [9]:
# Apply target encoding
df['Target_encoding_boro'] = df['Boro'].map(taregt_mean)

In [10]:
df

        Boro  Salary  Vegan  Target_encoding_boro
0  Manhattan     103      0                   0.0
1     Queens      89      0                   0.0
2  Manhattan     142      0                   0.0
3   Brooklyn      54      1                   1.0
4   Brooklyn      63      1                   1.0
5      Bronx     219      0                   0.0

In [29]:
import pandas as pd
import numpy as np

# Define the dataset
data = {'boro': ['Manhattan', 'Queens', 'Manhattan', 'Brooklyn', 'Brooklyn', 'Bronx'],
        'salary': [103, 89, 142, 54, 63, 219],
        'vegan': [0, 0, 0, 1, 1, 0]}
df = pd.DataFrame(data)

# Calculate prior probability of the target variable
nY = df['vegan'].sum()
n = len(df)
prior_prob = nY/n

# Calculate posterior probability of the target variable for each category level
df['ni'] = df.groupby('boro')['boro'].transform('count')
df['niY'] = df.groupby(['boro', 'vegan'])['boro'].transform('count')
df['post_prob'] = df['niY'] / df['ni']

# Define the blending function
def blending(ni, niY, prior_prob):
    e = np.exp(1)
    frac1 = (1 / (1 + e**(ni-1))) * (niY/ni)
    frac2 = (1 - (1 / (1 + e**(ni-1)))) * prior_prob
    return frac1 + frac2

# Apply the blending function to each category level to get the Target Encodings
df['boro_encoded'] = df.apply(lambda x: blending(x['ni'], x['niY'], prior_prob), axis=1)

# Extract and print the Target Encodings for the 'boro' feature
boro_encoded = df[['boro_encoded']].drop_duplicates().sort_values('boro_encoded')
boro_encoded.reset_index(drop=True, inplace=True)
boro_encoded

   boro_encoded
0      0.512628
1      0.666667